app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @book = Book.new #Newアクションのインスタンス変数
    @books = Book.all #indexアクションのインスタンス変数

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "練習４"], ["body", "練習４の内容です。"], ["created_at", "2022-01-25 13:02:44.934775"], ["updated_at", "2022-01-25 13:02:44.934775"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = "Book was successfully created."
      redirect_to book_path(book.id) #投稿したIDに紐づく詳細画面へ遷移
    else
      @books = Book.all